tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Packages to install
brew "ack"
brew "asdf"
brew "antidote"
brew "bash"
brew "bash-completion"
brew "bash-snippets"
brew "bat"
brew "bpytop"
brew "broot"
brew "calcurse"
brew "chkrootkit"
brew "cointop"
brew "coreutils"
brew "ctop"
brew "ddgr"
brew "docker"
brew "docker-compose"
brew "diff-so-fancy"
brew "elinks"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "glances"
brew "go"
brew "gzip"
brew "htop"
brew "httpie"
brew "ideviceinstaller ios-deploy cocoapods"
brew "jq"
brew "lazydocker"
brew "mackup"
brew "moreutils"
brew "n"
brew "nano"
brew "neofetch"
brew "neovim"
brew "npm"
brew "openssl"
brew "osxutils"
brew "pup"
brew "pyenv"
brew "python3"
brew "ranger"
brew "rbenv"
brew "recode"
brew "ripgrep"
brew "rust"
brew "screenfetch"
brew "shellcheck"
brew "spoof-mac"
brew "starship"
brew "stow"
brew "telnet"
brew "terminal-notifier"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "webp"
brew "weechat"
brew "wget"
brew "wv"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zoxide"
brew "zsh"
brew "zsh-completions"

# Fonts
cask "font-atkinson-hyperlegible"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g"
cask "font-inconsolata-g-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"

# Extras (uncomment as needed)
#cask "1password7"
#cask "adobe-creative-cloud"
#cask "adobe-digital-editions"
#cask "adobe-dng-converter"
#cask "android-file-transfer"
#cask "anki"
#cask "bartender"				# dozer open src alt below
#cask "battle-net"
#cask "calibre"
#cask "cityofzion-neon"
#cask "discord"
#cask "dropbox"
#cask "exodus"
#cask "firefly"
#cask "folding-at-home"
#cask "google-backup-and-sync"
#cask "heroku update"
#cask "heroku-toolbelt"
#cask "ledger-live"
#cask "little-snitch5"
#cask "microsoft-office"
#cask "microsoft-outlook"
#cask "nault"
#cask "notion"
#cask "openemu"
#cask "opera-beta"
#cask "overdrive-media-console"
#cask "plex-media-server"
#cask "protonvpn"
#cask "sia-ui"
#cask "signal-beta"
#cask "slack-beta"
#cask "steam"
#cask "suspicious-package"
#cask "telegram-desktop-beta"
#cask "tor-browser"
#cask "transmission-nightly"
#cask "tuxera-ntfs"
#cask "veracrypt"
#cask "vlc-nightly"
#cask "zoom"

# Work Essentials
cask "alacritty"
cask "alfred"
cask "arduino-nightly"
cask "arq5"
cask "automute"
cask "balenaetcher"
cask "brave-browser-nightly"
cask "caffeine"
cask "cheatsheet"
cask "daisydisk"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "docker-toolbox"
cask "dotnet-sdk"
cask "dozer"
cask "figma"
cask "firefox-nightly"
cask "flutter"
cask "flux"
cask "github"
cask "google-chrome-canary"
cask "gpg-suite-nightly"
cask "gyazo"
cask "hazel"
cask "hammerspoon"
cask "imagealpha"
cask "imageoptim"
cask "insomnia"
cask "install-disk-creator"
cask "iterm2-nightly"
cask "licecap"
cask "local" #WordPress local development tool by Flywheel
cask "macfuse" #Required for veracrypt
cask "macvim"
cask "micro-snitch"
cask "raspberry-pi-imager"
cask "sequel-pro"
cask "shortcat"
cask "shottr"
cask "spectacle"
cask "spotify"
cask "sublime-text-dev"
cask "thonny" #python ide for beginners
cask "transmit"
cask "utm" #Virtual machines UI using QEMU
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "xld"
cask "yubico-authenticator"

# quicklook plugins
cask "betterzipql"
cask "epsqlplugin"
cask "epub-quicklook"
cask "qlcolorcode"
cask "qlgradle"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlmobi"
cask "qlmoviepreview"
cask "qlplayground"
cask "qlstephen"
cask "qlswift"
cask "qltorrent"
cask "qlvideo"
cask "qlwoff"
cask "quickjson"
cask "quicklook-json"
cask "quicklookase"
cask "quicknfo"
cask "syntax-highlight"
cask "webpquicklook"

# Mac App Store Applications (Disabled by default)
#mas "Amphetamine", id: 937984704
#mas "Coin Tick", id: 1141688067
#mas "Dropover", id: 1355679052
#mas "iAWriter", id: 775737590
#mas "Keynote", id: 409183694
#mas "Magnet", id: 441258766
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Strongbox", id: 897283731
#mas "Tampermonkey", id: 1482490089
#mas "Xcode", id: 497799835
