# Homebrew taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Packages to install
brew "ack"                # Code search tool
brew "asdf"               # Extendable version manager for multiple programming languages
brew "antidote"           # Spell checker and grammar corrector
brew "bash"               # Bash shell
brew "bash-completion"    # Bash completion support
brew "bash-snippets"      # Collection of useful bash scripts
brew "bat"                # Cat clone with syntax highlighting
brew "bpytop"             # Resource monitor written in Python
brew "broot"              # Interactive file manager
brew "calcurse"           # Text-based calendar and scheduling application
brew "chkrootkit"         # Rootkit detector
brew "cointop"            # Interactive cryptocurrency price viewer
brew "composer"		  # Dependency Manager for PHP
brew "coreutils"          # GNU Core Utilities
brew "ctop"               # Top-like container monitoring tool
brew "ddgr"               # DuckDuckGo from the terminal
brew "docker"             # Containerization platform
brew "docker-compose"     # Docker Compose
brew "diff-so-fancy"      # Git diff highlighter
brew "elinks"             # Text-based web browser
brew "exa"                # Modern replacement for ls
brew "fd"                 # Simple, fast, and user-friendly find replacement
brew "ffmpeg"		  # Play, record, convert, and stream audio and video
brew "findutils"          # Collection of GNU find, xargs, and locate
brew "fzf"                # Fuzzy finder for the command-line
brew "gh"                 # GitHub CLI
brew "git"                # Distributed version control system
brew "git-extras"         # Git utilities
brew "git-lfs"            # Git extension for versioning large files
brew "glances"            # System monitoring tool
brew "go"                 # Go programming language
brew "gzip"               # Compression utility
brew "htop"               # Interactive process viewer
brew "httpie"             # User-friendly command-line HTTP client
brew "ideviceinstaller"   # iOS device management command-line tools
brew "ios-deploy"         # Command-line utility to deploy iOS apps to devices
brew "cocoapods"          # Dependency manager for iOS projects
brew "jq"                 # Lightweight and flexible command-line JSON processor
brew "lazydocker"         # Terminal UI for Docker and Docker Compose
brew "mackup"             # Backup and restore application settings
brew "moreutils"          # Collection of tools that make the basic UNIX commands more powerful
brew "n"                  # Node.js version management
brew "nano"               # Text editor
brew "neofetch"           # System information tool
brew "neovim"             # Vim-fork focused on extensibility and usability
brew "npm"                # Node package manager
brew "openssl"            # SSL/TLS cryptography library
brew "osxutils"           # Collection of macOS command-line utilities
brew "pup"                # Command-line HTML parsing tool
brew "pyenv"              # Python version management
brew "python3"            # Python programming language
brew "ranger"             # File manager with VI key bindings
brew "rbenv"              # Ruby version management
brew "recode"             # Charset converter and encoder/decoder
brew "ripgrep"            # Line-oriented search tool
brew "rust"               # Systems programming language
brew "screenfetch"        # Fetches system/theme information in terminal
brew "shellcheck"         # Static analysis tool for shell scripts
brew "spoof-mac"          # Change your MAC address
brew "starship"           # Cross-shell prompt
brew "stow"               # Symlink manager
brew "telnet"             # Telnet client
brew "terminal-notifier"  # Send macOS notifications from the command-line
brew "tig"                # Text-mode interface for Git
brew "tldr"               # Simplified and community-driven man pages
brew "tmux"               # Terminal multiplexer
brew "tree"               # Display directory tree structure
brew "vim"                # Vim text editor
brew "webp"               # Image format for the web
brew "weechat"            # Fast, light, and extensible IRC client
brew "wget"               # Internet file retriever
brew "wv"                 # Programs to access Microsoft Word documents
brew "yarn"               # Package manager for JavaScript
brew "youtube-dl"         # Command-line program to download videos from YouTube and other sites
brew "z"                  # Jump around directory
brew "zoxide"             # Fast directory jumper
brew "zsh"                # Zsh shell
brew "zsh-completions"    # Additional completions for Zsh

# Fonts
cask "font-atkinson-hyperlegible"                # Atkinson Hyperlegible font
cask "font-cascadia-code"                        # Cascadia Code font
cask "font-fira-code"                            # Fira Code font
cask "font-hack-nerd-font"                       # Nerd Fonts - Hack font
cask "font-inconsolata-dz"                       # Inconsolata DZ font
cask "font-inconsolata-dz-for-powerline"         # Inconsolata DZ font for Powerline
cask "font-inconsolata-for-powerline"            # Inconsolata font for Powerline
cask "font-inconsolata-g"                        # Inconsolata G font
cask "font-inconsolata-g-for-powerline"          # Inconsolata G font for Powerline
cask "font-jetbrains-mono"                       # JetBrains Mono font
cask "font-jetbrains-mono-nerd-font"             # JetBrains Mono Nerd Font
cask "font-open-sans"                            # Open Sans font
cask "font-open-sans-condensed"                  # Open Sans Condensed font
cask "font-roboto-mono-for-powerline"		 # Roboto Mono for Powerline
cask "font-roboto-mono-nerd-font"                # Roboto Mono Nerd Font
cask "font-sf-compact"				 # SanFrancisco Compact
cask "font-sf-mono"				 # SanFrancisco Mono
cask "font-sf-mono-for-powerline"		 # SanFrancisco for Powerline
cask "font-sf-pro"			         # SanFrancisco Pro
cask "font-source-code-pro"                      # Source Code Pro font

# Work Machine
#cask "adobe-creative-cloud"         # Adobe Creative Cloud suite
cask "alfred"                        # Productivity app for macOS
cask "arduino-nightly"               # Open-source electronics prototyping platform
cask "automute"                      # Automatically mute your microphone on system sleep
cask "bartender"                     # Menu bar organizer
cask "basecamp"			     # All-In-One Toolkit for Working Remotely
cask "brave-browser-nightly"         # Web browser focused on privacy and speed (Nightly version)
cask "caffeine"                      # Prevents your Mac from going to sleep
cask "cheatsheet"                    # Display keyboard shortcuts on-screen
cask "daisydisk"                     # Disk usage visualizer and cleanup tool
cask "dash"                          # Documentation browser and code snippet manager
cask "dbeaver-community"             # Free multi-platform database tool for developers
cask "docker"                        # Open platform for developing, shipping, and running applications
cask "docker-toolbox"                # Legacy version of Docker tools
cask "dotnet-sdk"                    # .NET software development kit
cask "dozer"                         # Menu bar app to hide and reveal system menu icons
cask "figma"                         # Collaborative interface design tool
cask "firefox"                       # Web browser
cask "firefox-nightly"               # Web browser by Mozilla (Nightly version)
cask "flutter"                       # UI toolkit for building natively compiled applications
cask "flux"                          # Adjusts your computer's display to adapt to the time of day
cask "github"                        # Version control platform and collaboration tool
cask "google-chrome"                 # Web browser by Google
cask "google-chrome-canary"          # Web browser by Google (Canary version)
cask "gpg-suite-nightly"             # Tools for secure communication and data encryption (Nightly version)
cask "gyazo"                         # Screen capture and image sharing tool
cask "hazel"                         # Automated organization for your files and folders
cask "hammerspoon"                   # Desktop automation tool
cask "imagealpha"                    # Lossy PNG compressor
cask "imageoptim"                    # Image optimization tool
cask "insomnia"                      # Cross-platform REST client
cask "install-disk-creator"          # Tool for creating bootable macOS install disks
#cask "iterm2"                       # Terminal emulator
cask "iterm2-nightly"                # Terminal emulator for macOS (Nightly version)
#cask "lastpass"                     # Password manager
cask "licecap"                       # Create animated GIFs of your screen
cask "local"                         # WordPress local development tool by Flywheel
cask "macfuse"                       # Required for Veracrypt
cask "macvim"                        # GUI for Vim text editor
#cask "microsoft-edge"               # Web browser
#cask "microsoft-office"             # Office suite
cask "micro-snitch"                  # Monitor and control microphone and camera usage
cask "qmk-toolbox"					 # Toolbox companion for QMK Firmware
cask "raspberry-pi-imager"           # Tool for easily installing Raspberry Pi OS images
cask "sequel-pro"                    # MySQL/MariaDB database management tool
#cask "slack"                        # Collaboration hub
cask "shortcat"                      # Keyboard productivity app
cask "shottr"                        # Screenshot and annotation tool
cask "spectacle"                     # Window manager that allows you to organize your windows with ease
cask "spotify"                       # Music streaming service
cask "thonny"                        # Python IDE for beginners
cask "transmit"                      # File transfer client
cask "utm"                           # Virtual machines UI using QEMU
cask "visual-studio-code"            # Source code editor developed by Microsoft
cask "visual-studio-code-insiders"   # Source code editor developed by Microsoft (Insiders version)
cask "xld"                           # Digital audio extraction tool
cask "yubico-authenticator"          # Authentication app for Yubico security keys
#cask "zoom"                         # Video conferencing and messaging platform

# Extras (uncomment as needed)
#cask "adobe-digital-editions"                # E-book reader software
#cask "adobe-dng-converter"                   # Adobe DNG Converter
#cask "android-file-transfer"                 # Android file transfer utility
#cask "anki"                                  # Flashcard program
#cask "arq7"                          	      # Backup and data management app
#cask "balenaetcher"                  	      # Tool for flashing OS images to SD cards and USB drives
#cask "battle-net"                            # Blizzard Battle.net gaming platform
#cask "calibre"                               # E-book management
#cask "cityofzion-neon"                       # NEO blockchain wallet
#cask "discord"                               # Voice, video, and text communication platform
#cask "dropbox"                               # File hosting service
#cask "exodus"                                # Cryptocurrency wallet
#cask "firecamp"                              # Collaboration platform for APIs
#cask "fontforge"                             # Font editor
#cask "franz"                                 # Messaging app for WhatsApp, Slack, and more
#cask "gimp"                                  # GNU Image Manipulation Program
#cask "google-backup-and-sync"                # Google Drive and Photos sync
#cask "handbrake"                             # Open-source video transcoder
#cask "insomnia"                              # API client
#cask "kap"                                   # Screen recorder
#cask "kdiff3"                                # File and directory diff and merge tool
#cask "notion"                                # Note-taking and collaboration tool
#cask "obs"                                   # Live streaming and recording software
#cask "postman"                               # API development and testing
#cask "plexamp"				      # Plex Music player focusing on visuals
#cask "steam"                                 # Gaming platform
#cask "teamviewer"                            # Remote control and desktop sharing software
#cask "vlc"                                   # Media player



# QuickLook plugins	      # QuickLook plugin for...
cask "betterzipql"            # BetterZip archives
cask "epsqlplugin"            # SQL files, allows previewing the content of SQL files
cask "epub-quicklook"         # EPUB files, enables previewing EPUB ebook content
cask "qlcolorcode"            # source code files, provides syntax highlighting for various programming languages
cask "qlgradle"               # Gradle build files, allows previewing the content of Gradle files
cask "qlimagesize"            # image files, displays the image dimensions and file size
cask "qlmarkdown"             # Markdown files, enables previewing Markdown formatted documents
cask "qlmobi"                 # MOBI files, allows previewing content of MOBI ebook files
cask "qlmoviepreview"         # video files, generates a movie preview thumbnail
cask "qlplayground"           # Swift playground files, allows previewing Swift code in playgrounds
cask "qlstephen"              # plain text files, provides plain text preview
cask "qlswift"                # Swift source code files, provides syntax highlighting for Swift
cask "qltorrent"              # BitTorrent files, allows previewing the content of torrent files
cask "qlvideo"                # video files, allows previewing video content
cask "qlwoff"                 # WOFF font files, allows previewing WOFF fonts
cask "quickjson"              # JSON files, enables previewing JSON data
cask "quicklook-json"         # JSON files, allows previewing JSON data
cask "quicklookase"           # ASE color swatch files, enables previewing ASE color swatches
cask "quicknfo"               # NFO files, allows previewing the content of NFO files
cask "syntax-highlight"       # code files, provides syntax highlighting for various programming languages
cask "webpquicklook"          # webP image files, allows previewing WebP images


# Mac App Store Applications (Disabled by default)
#mas "Amphetamine", id: 937984704          # App for keeping your Mac awake
#mas "Coin Tick", id: 1141688067           # Cryptocurrency ticker with notifications
#mas "Dropover", id: 1355679052            # App for simplifying drag and drop on your Mac
#mas "iAWriter", id: 775737590             # Distraction-free writing app
#mas "Keynote", id: 409183694              # Apple's presentation software
#mas "Magnet", id: 441258766               # Window manager for organizing your desktop
#mas "Numbers", id: 409203825              # Apple's spreadsheet application
#mas "Pages", id: 409201541                # Apple's word processor and page layout app
#mas "Strongbox", id: 897283731            # Securely store your passwords and sensitive information
#mas "Tampermonkey", id: 1482490089        # Userscript manager for web browsers
#mas "Xcode", id: 497799835                # Development environment for macOS and iOS
